testCases/3D_smoothTube/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 309.15;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        value           uniform 309.15;
        inletValue      uniform 309.15;
    }
    symmetry1
    {
        type            symmetryPlane;
    }
    symmetry2
    {
        type            symmetryPlane;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
    fluid_to_tube
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 299.15;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappaName       none;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
